import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-dashboard',
  templateUrl: './dashboard.component.html',
  styleUrls: ['./dashboard.component.scss']
})
export class DashboardComponent implements OnInit {

  advPieChart = [
    {
      "name": "00.00-05.59",
      "value": 0
    },
    {
      "name": "06.00-11.59",
      "value": 5
    },
    {
      "name": "12.00-17.59",
      "value": 3
    },
    {
      "name": "18.00-23.59",
      "value": 10
    }
  ];

  pieChart = [
    {
      "name": "ชาย",
      "value": 20
    },
    {
      "name": "หญิง",
      "value": 8
    }
  ];
  bubbleData =  [
    {
      name: 'จันทร์',
      series: [
        {
          name: '27 ธ.ค. - 2 ม.ค.',
          x: '27 ธ.ค. - 2 ม.ค.',
          y: '0.00-ุ2.59',
          r: 20
        },
        {
          name: '27 ธ.ค. - 2 ม.ค.',
          x: '27 ธ.ค. - 2 ม.ค.',
          y: '3.00-ุ5.59',
          r: 10
        },
        {
          name: '27 ธ.ค. - 2 ม.ค.',
          x: '27 ธ.ค. - 2 ม.ค.',
          y: '6.00-ุ8.59',
          r: 15
        },
        {
          name: '27 ธ.ค. - 2 ม.ค.',
          x: '27 ธ.ค. - 2 ม.ค.',
          y: '9.00-ุ11.59',
          r: 35
        },
        {
          name: '27 ธ.ค. - 2 ม.ค.',
          x: '27 ธ.ค. - 2 ม.ค.',
          y: '12.00-ุ14.59',
          r: 45
        },
        {
          name: '27 ธ.ค. - 2 ม.ค.',
          x: '27 ธ.ค. - 2 ม.ค.',
          y: '15.00-ุ17.59',
          r: 23
        },
        {
          name: '27 ธ.ค. - 2 ม.ค.',
          x: '27 ธ.ค. - 2 ม.ค.',
          y: '18.00-ุ20.59',
          r: 0
        },
        {
          name: '27 ธ.ค. - 2 ม.ค.',
          x: '27 ธ.ค. - 2 ม.ค.',
          y: '21.00-ุ00.59',
          r: 0
        }
      ]
    },
    {
      name: 'อังคาร',
      series: [
        {
          name: '3 ม.ค. - 9 ม.ค.',
          x: '3 ม.ค. - 9 ม.ค.',
          y: '0.00-ุ2.59',
          r: 20
        },
        {
          name: '3 ม.ค. - 9 ม.ค.',
          x: '3 ม.ค. - 9 ม.ค.',
          y: '3.00-ุ5.59',
          r: 10
        },
        {
          name: '3 ม.ค. - 9 ม.ค.',
          x: '3 ม.ค. - 9 ม.ค.',
          y: '6.00-ุ8.59',
          r: 15
        },
        {
          name: '3 ม.ค. - 9 ม.ค.',
          x: '3 ม.ค. - 9 ม.ค.',
          y: '9.00-ุ11.59',
          r: 35
        },
        {
          name: '3 ม.ค. - 9 ม.ค.',
          x: '3 ม.ค. - 9 ม.ค.',
          y: '12.00-ุ14.59',
          r: 45
        },
        {
          name: '3 ม.ค. - 9 ม.ค.',
          x: '3 ม.ค. - 9 ม.ค.',
          y: '15.00-ุ17.59',
          r: 23
        },
        {
          name: '3 ม.ค. - 9 ม.ค.',
          x: '3 ม.ค. - 9 ม.ค.',
          y: '18.00-ุ20.59',
          r: 0
        },
        {
          name: '3 ม.ค. - 9 ม.ค.',
          x: '3 ม.ค. - 9 ม.ค.',
          y: '21.00-ุ00.59',
          r: 0
        }
      ]
    },
    {
      name: 'พุธ',
      series: [
        {
          name: '11 ม.ค. - 16 ม.ค.',
          x: '11 ม.ค. - 16 ม.ค.',
          y: '0.00-ุ2.59',
          r: 20
        },
        {
          name: '11 ม.ค. - 16 ม.ค.',
          x: '11 ม.ค. - 16 ม.ค.',
          y: '3.00-ุ5.59',
          r: 10
        },
        {
          name: '11 ม.ค. - 16 ม.ค.',
          x: '11 ม.ค. - 16 ม.ค.',
          y: '6.00-ุ8.59',
          r: 15
        },
        {
          name: '11 ม.ค. - 16 ม.ค.',
          x: '11 ม.ค. - 16 ม.ค.',
          y: '9.00-ุ11.59',
          r: 35
        },
        {
          name: '11 ม.ค. - 16 ม.ค.',
          x: '11 ม.ค. - 16 ม.ค.',
          y: '12.00-ุ14.59',
          r: 45
        },
        {
          name: '11 ม.ค. - 16 ม.ค.',
          x: '11 ม.ค. - 16 ม.ค.',
          y: '15.00-ุ17.59',
          r: 23
        },
        {
          name: '11 ม.ค. - 16 ม.ค.',
          x: '11 ม.ค. - 16 ม.ค.',
          y: '18.00-ุ20.59',
          r: 0
        },
        {
          name: '11 ม.ค. - 16 ม.ค.',
          x: '11 ม.ค. - 16 ม.ค.',
          y: '21.00-ุ00.59',
          r: 0
        }
      ]
    },
    {
      name: 'พหัสบดี',
      series: [
        {
          name: '17 ม.ค. - 23 ม.ค.',
          x: '17 ม.ค. - 23 ม.ค.',
          y: '0.00-ุ2.59',
          r: 20
        },
        {
          name: '17 ม.ค. - 23 ม.ค.',
          x: '17 ม.ค. - 23 ม.ค.',
          y: '3.00-ุ5.59',
          r: 10
        },
        {
          name: '17 ม.ค. - 23 ม.ค.',
          x: '17 ม.ค. - 23 ม.ค.',
          y: '6.00-ุ8.59',
          r: 15
        },
        {
          name: '17 ม.ค. - 23 ม.ค.',
          x: '17 ม.ค. - 23 ม.ค.',
          y: '9.00-ุ11.59',
          r: 35
        },
        {
          name: '17 ม.ค. - 23 ม.ค.',
          x: '17 ม.ค. - 23 ม.ค.',
          y: '12.00-ุ14.59',
          r: 45
        },
        {
          name: '17 ม.ค. - 23 ม.ค.',
          x: '17 ม.ค. - 23 ม.ค.',
          y: '15.00-ุ17.59',
          r: 23
        },
        {
          name: '17 ม.ค. - 23 ม.ค.',
          x: '17 ม.ค. - 23 ม.ค.',
          y: '18.00-ุ20.59',
          r: 0
        },
        {
          name: '17 ม.ค. - 23 ม.ค.',
          x: '17 ม.ค. - 23 ม.ค.',
          y: '21.00-ุ00.59',
          r: 0
        }
      ]
    },
    {
      name: 'ศุกร์',
      series: [
        {
          name: '24 ม.ค. - 30 ม.ค.',
          x: '24 ม.ค. - 30 ม.ค.',
          y: '0.00-ุ2.59',
          r: 20
        },
        {
          name: '24 ม.ค. - 30 ม.ค.',
          x: '24 ม.ค. - 30 ม.ค.',
          y: '3.00-ุ5.59',
          r: 10
        },
        {
          name: '24 ม.ค. - 30 ม.ค.',
          x: '24 ม.ค. - 30 ม.ค.',
          y: '6.00-ุ8.59',
          r: 15
        },
        {
          name: '24 ม.ค. - 30 ม.ค.',
          x: '24 ม.ค. - 30 ม.ค.',
          y: '9.00-ุ11.59',
          r: 35
        },
        {
          name: '24 ม.ค. - 30 ม.ค.',
          x: '24 ม.ค. - 30 ม.ค.',
          y: '12.00-ุ14.59',
          r: 45
        },
        {
          name: '24 ม.ค. - 30 ม.ค.',
          x: '24 ม.ค. - 30 ม.ค.',
          y: '15.00-ุ17.59',
          r: 23
        },
        {
          name: '24 ม.ค. - 30 ม.ค.',
          x: '24 ม.ค. - 30 ม.ค.',
          y: '18.00-ุ20.59',
          r: 0
        },
        {
          name: '24 ม.ค. - 30 ม.ค.',
          x: '24 ม.ค. - 30 ม.ค.',
          y: '21.00-ุ00.59',
          r: 0
        }
      ]
    },
    {
      name: 'เสาร์',
      series: [
        {
          name: '27 ธ.ค. - 2 ม.ค.',
          x: '27 ธ.ค. - 2 ม.ค.',
          y: '0.00-ุ2.59',
          r: 20
        },
        {
          name: '27 ธ.ค. - 2 ม.ค.',
          x: '27 ธ.ค. - 2 ม.ค.',
          y: '3.00-ุ5.59',
          r: 10
        },
        {
          name: '27 ธ.ค. - 2 ม.ค.',
          x: '27 ธ.ค. - 2 ม.ค.',
          y: '6.00-ุ8.59',
          r: 15
        },
        {
          name: '27 ธ.ค. - 2 ม.ค.',
          x: '27 ธ.ค. - 2 ม.ค.',
          y: '9.00-ุ11.59',
          r: 35
        },
        {
          name: '27 ธ.ค. - 2 ม.ค.',
          x: '27 ธ.ค. - 2 ม.ค.',
          y: '12.00-ุ14.59',
          r: 45
        },
        {
          name: '27 ธ.ค. - 2 ม.ค.',
          x: '27 ธ.ค. - 2 ม.ค.',
          y: '15.00-ุ17.59',
          r: 23
        },
        {
          name: '27 ธ.ค. - 2 ม.ค.',
          x: '27 ธ.ค. - 2 ม.ค.',
          y: '18.00-ุ20.59',
          r: 0
        },
        {
          name: '27 ธ.ค. - 2 ม.ค.',
          x: '27 ธ.ค. - 2 ม.ค.',
          y: '21.00-ุ00.59',
          r: 0
        }
      ]
    },
    {
      name: 'อาทิตย์',
      series: [
        {
          name: '27 ธ.ค. - 2 ม.ค.',
          x: '27 ธ.ค. - 2 ม.ค.',
          y: '0.00-ุ2.59',
          r: 20
        },
        {
          name: '27 ธ.ค. - 2 ม.ค.',
          x: '27 ธ.ค. - 2 ม.ค.',
          y: '3.00-ุ5.59',
          r: 10
        },
        {
          name: '27 ธ.ค. - 2 ม.ค.',
          x: '27 ธ.ค. - 2 ม.ค.',
          y: '6.00-ุ8.59',
          r: 15
        },
        {
          name: '27 ธ.ค. - 2 ม.ค.',
          x: '27 ธ.ค. - 2 ม.ค.',
          y: '9.00-ุ11.59',
          r: 35
        },
        {
          name: '27 ธ.ค. - 2 ม.ค.',
          x: '27 ธ.ค. - 2 ม.ค.',
          y: '12.00-ุ14.59',
          r: 45
        },
        {
          name: '27 ธ.ค. - 2 ม.ค.',
          x: '27 ธ.ค. - 2 ม.ค.',
          y: '15.00-ุ17.59',
          r: 23
        },
        {
          name: '27 ธ.ค. - 2 ม.ค.',
          x: '27 ธ.ค. - 2 ม.ค.',
          y: '18.00-ุ20.59',
          r: 0
        },
        {
          name: '27 ธ.ค. - 2 ม.ค.',
          x: '27 ธ.ค. - 2 ม.ค.',
          y: '21.00-ุ00.59',
          r: 0
        }
      ]
    }
  ];

  // bubbleData =  [
  //   {
  //     name: '1.00-1.59',
  //     series: [
  //       {
  //         name: 'มกราคม 2563',
  //         x: 'มกราคม 2563',
  //         y: 1,
  //         r: 20
  //       },
  //       {
  //         name: 'กุมพาพันธ์ 2563',
  //         x: 'กุมพาพันธ์ 2563',
  //         y: 2,
  //         r: 10
  //       },
  //       {
  //         name: 'มีนนาคม 2563',
  //         x: 'มีนนาคม 2563',
  //         y: 3,
  //         r: 5
  //       }
  //     ]
  //   },
  //   {
  //     name: '2.00-2.59',
  //     series: [
  //       {
  //         name: 'มกราคม 2563',
  //         x: 'มกราคม 2563',
  //         y: 1,
  //         r: 0
  //       },
  //       {
  //         name: 'กุมพาพันธ์ 2563',
  //         x: 'กุมพาพันธ์ 2563',
  //         y: 2,
  //         r: 5
  //       },
  //       {
  //         name: 'มีนนาคม 2563',
  //         x: 'มีนนาคม 2563',
  //         y: 3,
  //         r: 3
  //       }
  //     ]
  //   }
  // ];
  

  // options
  gradient: boolean = true;
  showLegend: boolean = true;
  showLabels: boolean = true;
  isDoughnut: boolean = false;

  colorScheme = {
    domain: ['#5AA454', '#A10A28', '#C7B42C', '#AAAAAA']
  };

  constructor() {
  }

  ngOnInit(): void {
  }

}
